// Задайте массив заполненный случайными положительными трёхзначными числами. 
// Напишите программу, которая покажет количество чётных чисел в массиве.
    // [345, 897, 568, 234] -> 2

    Console.WriteLine("Кол-во четных чисел в массиве случайных чисел");

    